app/controllers/api/donations_controller.rb

    def create
        @donation = Donation.new(donation_params)
        # debugger

        if @donation.save
---
INSERT INTO "donations" ("monthly_amount", "first_name", "last_name", "city", "state", "zip_code", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"